Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_and_work/disability_payments_and_work.html.txt.tmx
Source language: en
Languages: ga

source: Disability payments and work
ga: Na híocaíochtaí míchumais agus obair

source: • Employment and disability payments
ga: • Fostaíocht agus íocaíochtaí míchumais

source: If you are getting certain disability payments you may be allowed to do work or training that is considered rehabilitative or therapeutic
ga: Má tá íocaíochtaí áirithe míchumais á bhfáil agat, b’fhéidir go gceadófaí duit obair nó oiliúint a dhéanamh a mheastar atá athshlánaithe nó teiripeach

source: People getting Illness Benefit and Invalidity Pension cannot work (except for unpaid voluntary work). They must transfer to the Partial Capacity Scheme if they wish to work
ga: Ní mór do dhaoine atá ag fáil íocaíochtaí leasa shóisialaigh ar mian leo oibriú (gan obair dheonach a áireamh) aistriú chuig an Scéim um Chumas Páirteach

source: In most cases you need permission to take up rehabilitative work, voluntary work or training
ga: I roinnt cásanna, teastaíonn cead uait chun glacadh le hobair athshlánúcháin nó le hoiliúint athshlánúcháin

source: This permission is sometimes called an exemption
ga: Tugtar díolúine ar an gcead sin corruair

source: Exemptions are always granted for a specific period of time
ga: Deonaítear díolúintí (le haghaidh cúrsaí oibre agus cúrsaí oiliúna araon) do thréimhse shonrach ama i gcónaí

source: At the end of that period you must re-apply
ga: Ní mór duit iarratas a dhéanamh an athuair ag deireadh na tréimhse sin

source: In general, if you are getting a means-tested payment your income from work will be assessed in the means test
ga: Go ginearálta, measúnófar d’ioncam ón obair i dtástáil acmhainne má tá íocaíocht atá tástáilte ó thaobh acmhainne á fáil agat

source: However some of your income from work is not assessed
ga: Ní mheasúnófar cuid de d’ioncam ón obair, áfach

source: Employment and disability payments
ga: Fostaíocht agus íocaíochtaí míchumais

source: Social assistance (means-tested) payments: Disability Allowance and Blind Pension are means-tested disability payments
ga: Íocaíochtaí míchumais chúnaimh shóisialta: Íocaíochtaí míchumais ar a ndéantar tástáil mhaoine iad an Liúntas Míchumais agus Pinsean na nDall

source: If you wish to do rehabilitative work, you must get written permission from the Department of Social Protection (DSP) before starting any work
ga: Más mian leat obair athshlánaithe a dhéanamh, ní mór duit cead i scríbhinn a fháil ón Roinn Coimirce Sóisialaí chun do Liúntas Míchumais nó Pinsean na nDall a choimeád

source: For both payments you need to provide a letter from your doctor certifying that the proposed work is rehabilitative. You also need to provide confirmation of your earnings (a payslip, your contract of employment or a letter from your employer)
ga: Maidir leis an dá íocaíocht, teastaíonn uait litir a sholáthar ó do dhochtúir a dheimhníonn gurb obair athshlánaithe atá i gceist leis an obair a bheartaítear a dhéanamh

source: You do not need to have been getting your payment for a minimum period of time before you can apply for permission to work
ga: Maidir leis an dá íocaíocht, ní mór duit dearbhú do thuilleamh (duillín phá, do chonradh fostaíochta nó litir ó d’fhostóir) a sholáthar

source: You may keep your Disability Allowance or Blind Pension if you get an exemption and your income is below a certain level
ga: Ní gá go raibh d’íocaíocht á fáil agat ar feadh tréimhse íosta sular féidir leat iarratas a dhéanamh

source: To qualify for a means-tested payment your income from various sources is examined to see whether it is under a certain level
ga: Chun cáiliú d’íocaíocht ar a ndéantar tástáil mhaoine ó fhoinsí éagsúla, scrúdaítear d’ioncam féachaint an bhfuil sé faoi leibhéal áirithe

source: Some earnings from rehabilitative work are not taken into account in the assessment of your means and do not affect your payment
ga: Ní chuirtear roinnt tuilleamh ó obair athshlánaithe san áireamh sa mheasúnú ar do mhaoin agus ní dhéanann siad difear do d’íocaíocht

source: For Disability Allowance and Blind Pension, earnings of up to €120 from rehabilitative work (either as an employee or as a self-employed person) are not taken into account at all in the assessment of means
ga: I gcás Liúntas Míchumais agus Phinsean na nDall, ní chuirtear tuillimh a fhad le €120 ó obair athshlánaithe san áireamh sa mheasúnú ar do mhaoin

source: (The means assessed are your gross earnings less PRSI, any pension contributions and any union dues
ga: (Is ionann an mhaoin ar a ndéantar measúnú agus d'olltuillimh lúide ÁSPC, aon ranníocaíochtaí pinsin agus aon dleachtanna ceardchumainn

source: You cannot deduct income tax or income levies.)
ga: Ní féidir leat cáin ioncaim nó tobhaigh ioncaim a bhaint as seo.)

source: If you earn more than €120 per week from rehabilitative work, 50% of your earnings between €120 and €350 are not taken into account in the Disability Allowance or Blind Pension means test
ga: Má tá do thuillimh ó obair athshlánaithe os cionn €120 sa tseachtain, ní thógfar 50% ded' thuillimh idir €120 agus €350 san áireamh sa tástáil acmhainne don Liúntas Míchumais nó Pinsean na nDall

source: Disability Allowance: all earnings over €350 are assessed as income and your entitlement to Disability Allowance will be reduced in line with the appropriate reduced rates of payment for Disability Allowance
ga: Measúnófar, ámh, tuillimh iomlán os cionn €350 mar ioncam agus laghdófar do theidlíocht don Liúntas Míchumais ar aon dul leis na rátaí laghdaithe íocaíochta cuí don Liúntas Míchumais

source: If you have no other means, the maximum amount you can earn is €427.50 and still keep an entitlement to the minimum personal payment of €3 (2017). If you are getting payments for a qualified adult or qualified children your means from rehabilitative work are deducted from the family rate that applies to you
ga: Mura mbíonn aon acmhainní eile agat, is é €427.50 an t-uasmhéid is féidir leat a thuilleamh agus do theidlíocht fós don íocaíocht íosta an Liúntais Mhíchumais €3 a choinneáil

source: Blind Pension: all earnings over €350 will also be assessed as income and your entitlement to Blind Pension will be reduced in line with the appropriate reduced rates of payment for Blind Pension
ga: Má tá Pinsean na nDall agat measúnófar aon thuillimh os cionn €350 agus laghdófar do theidlíocht do Phinsean na nDall ar aon dul leis na rátaí laghdaithe íocaíochta cuí do Phinsean na nDall

source: If you have no other means, the maximum amount you can earn is €432.60 and still keep an entitlement to the minimum personal payment of €3 (2017)
ga: Mura mbíonn aon acmhainní eile agat, is é €432.60 an t-uasmhéid is féidir leat a thuilleamh agus do theidlíocht fós don íocaíocht íosta an Phinsin na nDall a choinneáil

source: While no restriction has been placed on the number of hours you may work you should use a maximum of 20 hours a week as a guideline
ga: Cé nach bhfuil aon bhac ar uimhir na n-uaireanta gur féidir leat a oibriú ba chóir duit uasmhéid 20 uair a úsáid mar threoirlíne

source: Social insurance payments: Invalidity Pension and Illness Benefit are social insurance (PRSI-based) payments. You cannot work while you are getting these payments (with the exception of voluntary unpaid work)
ga: Íocaíochtaí árachais shóisialta: Íocaíochtaí árachais shóisialta (ÁSPC-bhunaithe) iad Pinsean Easláinte agus Sochar Breoiteachta

source: If you have been getting Invalidity Pension or Illness Benefit (for at least 6 months) you can apply for Partial Capacity Benefit, if you have a reduced capacity to work
ga: Ma bhí Pinsean Easláinte nó Sochar Breoiteachta á fháil agat (ar feadh 6 mhí ar a laghad), féadfaidh tú iarratas a dhéanamh ar Shochar Cumais Pháirtigh

source: The work does not have to be considered rehabilitative
ga: má laghdaíodh do chumas chun oibre

source: You may have to pay income tax on your total income
ga: Ní gá go meastar gurb athshlánaithe an obair seo

source: Exemptions for rehabilitative work are no longer available
ga: Níl fáil a thuilleadh ar dhíolúintí ar obair athshlánaithe

source: Occupational Injuries Benefit Scheme and rehabilitative work
ga: An Scéim um Shochair Dhíobhálacha Ceirde agus obair athshlánaithe

source: Injury Benefit is one of the benefits available under the Occupational Injuries Scheme
ga: I measc na sochar ar a bhfuil fáil faoin Scéim um Shochair Dhíobhálacha Ceirde tá Sochar Díobhála

source: If you are getting Injury Benefit you can do light voluntary work
ga: Má tá Sochar Díobhála á fháil agat, féadfaidh tú obair éadroim dheonach a dhéanamh

source: You can also do part-time work which is part of a treatment or charitable in character (provided you do not earn more than €50 a week) without permission
ga: Ina theannta sin, féadfaidh tú obair pháirtaimseartha a dhéanamh atá mar chuid de chóireáil nó atá de chineál carthanachta mura dtuilleann tú breis agus €50 sa tseachtain) gan cead a fháil

source: However if you wish to do other rehabilitative work or a training course you must get written permission from the DSP (called an exemption) before starting
ga: Más mian leat obair eile athshlánaithe nó cúrsa oiliúna a dhéanamh, áfach, ní mór duit cead i scríbhinn a fháil ón RCS (ar a dtugtar díolúine) sula dtosaíonn tú

source: Exemptions allowing a person to work are not normally granted within the first 26 weeks of Injury Benefit
ga: Ní gnách go gceadaítear díolúintí a cheadaíonn do dhuine oibriú laistigh de na chéad 26 seachtain de Shochar Díobhála

source: Incapacity Supplement is paid to people who are getting Disablement Pension and who do not qualify for any other disability payments
ga: Íoctar Forlíonadh Éagumais le daoine ag a bhfuil Sochar Míchumais á fháil agus nach gcáilítear iad le haghaidh aon íocaíochtaí eile míchumais

source: You can work provided you do not earn more than €33 a week on average
ga: Féadfaidh tú oibriú a fhad agus nach dtuilleann tú breis agus €33 sa tseachtain

source: However if you wish to do other rehabilitative work or a training course you must get written permission from the DSP before starting
ga: Más mian leat obair eile athshlánaithe nó cúrsa oiliúna a dhéanamh, áfach, ní mór duit cead i scríbhinn a fháil ón RCS sula dtosaíonn tú

source: Initial requests for an exemption to do training courses are automatically granted but subsequent requests are referred to a DSP medical advisor
ga: Ceadaítear iarratais ar dhíolúine chun cúrsaí oiliúna a dhéanamh go huathoibríoch ach cuirtear iarratais ina dhiaidh sin faoi bhráid comhairleoir leighis den RCS

source: If you wish to take part in a Community Employment Scheme you cannot retain your Incapacity Supplement but you can retain your Disablement Benefit
ga: Más mian leat páirt a ghlacadh i Scéim Fostaíocht Pobail, ní féidir leat d’Fhorlíonadh Éagumais a choimeád, ach féadfaidh tú do Shochar Míchumais a choimeád

source: People getting Disablement Pension (without another payment) can work (full- or part-time) and do not need permission from the Department
ga: Féadfaidh daoine ag a bhfuil Sochar Míchumais (gan íocaíocht eile) oibriú (go lánaimseartha nó go páirtaimseartha) agus ní gá dóibh cead a fháil ón Roinn

source: Employment schemes and other payments
ga: Scéimeanna fostaíochta agus íocaíochtaí eile

source: People getting Disability Allowance can qualify for the Rural Social Scheme (if they are actively farming or fishing)
ga: Is féidir le daoine atá ag fáil Liúntas Míchumais cáiliú le haghaidh an Scéim Shóisialta Tuaithe (más ag feirmeoireacht nó ag iascaireacht go gníomhach atá siad)

source: People getting Illness Benefit, Invalidity Pension, Disability Allowance, and Blind Pension can qualify for the Work Placement Programme and Community Employment
ga: Is féidir le daoine atá ag fáil Sochar Breoiteachta, Pinsean Easláine, Liúntas Míchumais agus Phinsean na nDall cáiliú le haghaidh an Chláir um Shocrúchán Oibre agus Fostaíocht Pobail

source: People getting disability payments are not eligible for the TÚS or Gateway schemes
ga: Ní incháilithe i leith scéimeanna TÚS ná Gateway atá daoine atá ag fáil íocaíochtaí míchumais

source: People getting Disability Allowance and Blind Pension can qualify for Family Income Supplement (FIS) if they meet the criteria
ga: Is féidir le daoine atá ag fáil Liúntas Míchumais agus Pinsean na nDall cáiliú le haghaidh Forlíonadh Ioncaim Teaghlaigh (FIT) má chomhlíonann siad na critéir

source: People getting Invalidity Pension and Illness Benefit cannot work and therefore cannot qualify for FIS
ga: Ní féidir le daoine atá ag fáil Pinsean Easláinte agus Sochar Breoiteachta oibriú agus dá bhrí sinn ní féidir leo cáiliú le haghaidh FIT

source: People getting Partial Capacity Benefit do not qualify for FIS
ga: Ní cháilíonn daoine atá ag fáil Sochar Cumais Pháirtigh le haghaidh FIT

source: If you work while getting Disability Allowance or Blind Pension you can retain any extra benefits you were getting
ga: Má oibríonn tú le linn duit Liúntas Míchumais nó Pinsean na nDall a fháil, féadfaidh tú aon sochair bhreise a bhí tú ag fáil a choinneáil

source: However the amount of Rent Supplement you get may be affected by your increased income
ga: Mar sin féin, is féidir le d’ioncam méadaithe dul i bhfeidhm ar mhéid an Fhorlíonta Cíosa a fhaigheann tú

source: In general you can retain any extra benefits you were getting when you take part in an employment scheme
ga: Go ginearálta, is féidir leat aon sochair bhreise a bhí tú ag fáil a choinneáil nuair a ghlacann tú páirt i scéim fostaíochta

source: You can read about Rent Supplement and how additional income from work or taking part in an employment scheme may affect it in our document on Rent Supplement and changes to your circumstances
ga: Is féidir leat léamh faoin bhForlíonadh Cíosa agus conas a d’fhéadfadh ioncam breise ón obair nó ó pháirt a ghlacadh i scéim fostaíochta dul i bhfeidhm air inár gcáipéis maidir le Forlíonadh Cíosa agus athruithe ar do chúinsí

source: If you are getting Disability Allowance or Blind Pension and take up a place on a FET training course you receive a training allowance at the same rate as your social welfare payment
ga: Más rud é go bhfuil Liúntas Míchumais nó Pinsean na nDall á fháil agat agus go nglacann tú le háit ar chúrsa oiliúna FET, gheobhaidh tú liúntas oiliúna ag an ráta céanna is atá d’íocaíocht leasa shóisialaigh

source: Your social welfare payment is suspended when you are on the training course
ga: Tá d’íocaíocht leasa shóisialaigh ar fionraí agus tú ar an gcúrsa oiliúna

source: You can return to your social welfare payment when you leave the training course
ga: Is féidir leat d’íocaíocht leasa shóisialaigh a fháil arís nuair a fhágann tú an cúrsa oiliúna

source: If you were getting Invalidity Pension or Illness Benefit, and take up a place on a FET training course you will continue to get your full social welfare payment including any increases you get for your dependents
ga: Más rud é go raibh tú ag fáil Pinsean Easláine nó Sochar Breoiteachta agus go nglacann tú áit ar chúrsa oiliúna de chuid FET, leanfaidh tú ar aghaidh ag fáil d’íocaíochta iomláine leasa shóisialaigh, lena n-áirítear aon mhéaduithe a fhaigheann tú i gcomhair do chleithiúnaithe

source: You do not get a training allowance or a training bonus
ga: Ní bhfaighidh tú liúntas oiliúna ná bónas oiliúna

source: You must always apply for prior written permission from DSP before you can take up a training course
ga: Ní mór duit i gcónaí iarratas a dhéanamh ar réamhchead i scríbhinn ón Roinn Coimirce Sóisialaí sular féidir leat tabhairt faoi chúrsa oiliúna

source: You can read more in our document on training allowances
ga: Is féidir tuilleadh faisnéise a léamh inár gcáipéis maidir le liúntais oiliúna

source: You retain any extra benefits that you had before taking up the course
ga: Coinníonn tú aon sochair bhreise a bhí agat sular thug tú faoin gcúrsa

source: You can read about how taking part in a training course may affect your Rent Supplement in our document on Rent Supplement and changes to your circumstances
ga: Is féidir leat léamh faoi conas a d’fhéadfaí dul i bhfeidhm ar d’Fhorlíonadh Cíosa dá nglacfá páirt i gcúrsa oiliúna inár gcáipéis maidir le Forlíonadh Cíosa agus athruithe ar do chúinsí
